//******************************************************************************
//
//
//      シーン管理
//
//
//******************************************************************************

//------< インクルード >---------------------------------------------------------
#include "Scene.h"
#include "Game_lib.h"
//==============================================================================
//
//      Sceneクラス
//
//==============================================================================

//--------------------------------
//  実行
//--------------------------------
Scene* Scene::execute()
{
	using namespace GameLib;

	// 初期化処理
	init();

	VECTOR4 color = VECTOR4(0.0f, 0.125f, 0.3f, 1.0f);
	// ゲームループ
	while (GameLib::gameLoop(true))
	{
		// 入力処理
		//input::update();

		// 更新処理
		update();

		Render();
		clear(color);

		// 描画処理
		draw();
										// 画面フリップ
		GameLib::present(0, 0);     //垂直同期(1,0)

		// 終了チェック
		if (nextScene) break;
	}

	// 終了処理
	uninit();

	return nextScene;	// 次のシーンを返す
}

//******************************************************************************
//
//      SceneManagerクラス
//
//******************************************************************************

//--------------------------------
//  実行
//--------------------------------
void SceneManager::execute(Scene* scene)
{
	using namespace GameLib;
	bool isFullScreen = false;	// フルスクリーンにするならtrueに変える
								//（Releaseモードのみ）

								// ゲームライブラリの初期化処理
	GameLib::init(L"ECC名門学校", system::SCREEN_WIDTH, system::SCREEN_HEIGHT, isFullScreen);
	
	ShowCursor(!isFullScreen);	// フルスクリーン時はカーソルを消す

								// メインループ
	while (scene)
	{
		scene = scene->execute();
	}

	// ゲームライブラリの終了処理
	GameLib::uninit();
}

//******************************************************************************
